class Ephemeris:
    def __init__(self, health=None, age=None, flags=None, sv=None, frqNum=None, dne=None, tk=None, tb=None,
                 r=None, v=None, w=None, tauSys=None, tau=None, gamma=None, name=None):
        self.health = health  # состояние спутника
        self.age = age  # возраст эфемеридной информации
        self.flags = flags  # флаги
        self.sv = sv  # номер слота орбиты спутника от 1 до 24
        self.frqNum = frqNum  # номер частотного канала спутника от –7 до +6

        self.dne = dne  # номер суток ГЛОНАСС внутри четырехлетнего периода
        self.tk = tk  # время начала кадра в текущих сутках ГЛОНАСС [с]
        self.tb = tb  # узловой момент времени эфемерид по шкале МДВ [с] внутри суток dne

        self.r = r  # координаты спутника в системе PЗ-90 на момент tb
        self.v = v  # скорости спутника в системе PЗ-90 на момент tb
        self.w = w  # ускорения спутника в системе PЗ-90 на момент tb

        self.tauSys = tauSys  # поправка к шкале времени ГЛОНАСС для перехода на шкалу МДВ (tauSys = Тмдв - Тглн [с])
        self.tau = tau  # поправка к шкале времени спутника для перехода на шкалу ГЛОНАСС (tau = Тглн - Тка [с])
        self.gamma = gamma  # относительное отклонение прогнозируемого значения несущей частоты на момент tb

        self.name = name  # "название" спутника


sat4 = Ephemeris(health=0, age=0, flags=141, sv=4, frqNum=6, dne=578, tk=77400, tb=78300,
                 r=[-7976.099121093750000, 10250.142089843750000, 21974.189941406250000],
                 v=[-3.003422737121582, -0.023105621337891, -1.081212043762207],
                 w=[-0.000000001862645, -0.000000000931323, -0.000000000931323],
                 tauSys=-0.000000189058483, tau=-0.000042061321437, gamma=0.000000000000909, name='Спутник 4')

sat5 = Ephemeris(health=0, age=0, flags=141, sv=5, frqNum=1, dne=578, tk=77400, tb=78300,
                 r=[11406.827148437500000, 10131.943847656250000, 20440.770996093750000],
                 v=[-2.795928955078125, -0.131600379943848, 1.625444412231445],
                 w=[0.000000000000000, 0.000000000000000, -0.000000002793968],
                 tauSys=-0.000000189058483, tau=0.000169168226421, gamma=0.000000000000000, name='Спутник 5')

sat6 = Ephemeris(health=0, age=0, flags=141, sv=6, frqNum=-4, dne=578, tk=77400, tb=78300,
                 r=[24342.756347656250000, 3797.545898437500000, 6671.118164062500000],
                 v=[-0.909827232360840, -0.160531044006348, 3.404714584350586],
                 w=[0.000000000931323, 0.000000000931323, -0.000000001862645],
                 tauSys=-0.000000189058483, tau=-0.000032551586628, gamma=0.000000000000000, name='Спутник 6')

sat13 = Ephemeris(health=0, age=0, flags=141, sv=13, frqNum=-2, dne=578, tk=77400, tb=78300,
                  r=[-11580.042968750000000, -855.917968750000000, 22690.449707031250000],
                  v=[1.662919998168945, -2.636009216308594, 0.747082710266113],
                  w=[-0.000000002793968, -0.000000000931323, -0.000000000931323],
                  tauSys=-0.000000189058483, tau=0.000401012599468, gamma=-0.000000000000909, name='Спутник 13')

sat14 = Ephemeris(health=0, age=0, flags=141, sv=14, frqNum=-7, dne=578, tk=77400, tb=78300,
                  r=[-16050.573242187500000, 14867.699218750000000, 13161.539550781250000],
                  v=[1.122589111328125, -1.430501937866211, 2.971652984619141],
                  w=[-0.000000001862645, -0.000000000931323, 0.000000000000000],
                  tauSys=-0.000000189058483, tau=0.000012516044080, gamma=-0.000000000000909, name='Спутник 14')

sat19 = Ephemeris(health=0, age=0, flags=141, sv=19, frqNum=3, dne=578, tk=77400, tb=78300,
                  r=[12398.836914062500000, 22230.053710937500000, 1671.189941406250000],
                  v=[0.273331642150879, 0.116469383239746, -3.573365211486816],
                  w=[0.000000001862645, 0.000000000000000, -0.000000001862645],
                  tauSys=-0.000000189058483, tau=0.000065584667027, gamma=-0.000000000000909, name='Спутник 19')

sat20 = Ephemeris(health=0, age=0, flags=141, sv=20, frqNum=2, dne=578, tk=77400, tb=78300,
                  r=[14947.758300781250000, 11321.744628906250000, 17328.319824218750000],
                  v=[1.203867912292480, 2.046018600463867, -2.370450973510742],
                  w=[0.000000000000000, 0.000000000000000, -0.000000002793968],
                  tauSys=-0.000000189058483, tau=0.000058603473008, gamma=-0.000000000000909, name='Спутник 20')

sat21 = Ephemeris(health=0, age=0, flags=141, sv=21, frqNum=4, dne=578, tk=77400, tb=78300,
                  r=[10180.483886718750000, -3836.068847656250000, 23064.704589843750000],
                  v=[1.483661651611328, 2.790823936462402, -0.199043273925781],
                  w=[0.000000000000000, 0.000000000000000, -0.000000001862645],
                  tauSys=-0.000000189058483, tau=0.000008144415915, gamma=-0.000000000000909, name='Спутник 21')

sat22 = Ephemeris(health=0, age=0, flags=140, sv=22, frqNum=-3, dne=578, tk=77940, tb=78300,
                  r=[-344.439941406250000, -18270.123046875000000, 17727.150390625000000],
                  v=[1.049692153930664, 2.198596000671387, 2.299607276916504],
                  w=[-0.000000001862645, 0.000000000000000, 0.000000000000000],
                  tauSys=-0.000000189058483, tau=-0.000092483125627, gamma=0.000000000000000, name='Спутник 22')


def set_sat():
    return [sat4, sat5, sat6, sat13, sat14, sat19, sat20, sat21, sat22]
